/* Localized versions of strings used in the QuartzComposer UI */

PortEditing_True = "True";
PortEditing_False = "False";

PortTooltip_Name = "Name";
PortTooltip_Description = "Description";
PortTooltip_Key = "Key";
PortTooltip_Type = "Type";
PortTooltip_OriginalName = "Original Name";
PortTooltip_PublishedKey = "Published Key";
PortTooltip_Value = "Value";
PortTooltip_RGBA = "RGBA";
PortTooltip_Bounds = "Bounds";
PortTooltip_UndefinedDimensions = "Infinite (needs cropping to render)";
PortTooltip_Provider = "Provider Class";
PortTooltip_Members = "Member(s)";
PortTooltip_OpenGLBacking = "OpenGL Backing";
PortTooltip_TextureBacking = "Texture Backing";
PortTooltip_ColorSpace = "Colorspace";
PortTooltip_PixelFormat = "Native Pixel Format";
PortTooltip_Uncorrected = " [Uncorrected]";
PortTooltip_BoundingBox = "Bounding Box";
PortTooltip_Vertices = "Vertices";
PortTooltip_Colors = "Colors";
PortTooltip_Normals = "Normals";
PortTooltip_Indices = "Indices";
PortTooltip_FlipCulling = "Flipped Culling";
PortTooltip_True = "True";
PortTooltip_False = "False";
PortTooltip_UndefinedComponent = "Undefined";
PortTooltip_UndefinedBoundingBox = "Undefined";

PatchTooltip_Name = "Real Name";
PatchTooltip_Category = "Category";
PatchTooltip_Key = "Key";
PatchTooltip_ActiveCount = "Activation Count";
PatchTooltip_NextExecutionTime = "Recommended Next Execution Time";
PatchTooltip_Timebase = "Timebase";
PatchTooltip_Description = "Description";

PatchTimebase_Idle = "Idle";
PatchTimebase_None = "None";
PatchTimebase_Parent = "Parent";
PatchTimebase_External = "External";
PatchTimebase_Local = "Local";

Inspector_SettingsTitle = "Settings";
Inspector_InputsTitle = "Input Parameters";
Inspector_PlugInViewTitle = "Settings";
Inspector_PublishingTitle = "Published Inputs & Outputs";

PatchMenu_EditMacro = "Edit Macro Patch...";
PatchMenu_ExplodeSubgraph = "Explode Macro";
PatchMenu_Timebase = "Timebase";
PatchMenu_Parent = "Parent";
PatchMenu_Local = "Local";
PatchMenu_External = "External";
PatchMenu_Layer = "Layer";
PatchMenu_AddMacro = "Create Macro Patch";
PatchMenu_CreateMacro = "Create Macro Patch With Selection";
PatchMenu_EditParent = "Edit Parent Patch...";
PatchMenu_RefactorInput = "Insert Input Splitter";
PatchMenu_RefactorOutput = "Insert Output Splitter";

ManagerView_Category = "Category";
ManagerView_Name = "Name";

ParametersView_NotEditable = "<%@ not editable>";

QCVirtualPort = "Virtual";

QCBooleanPort = "Boolean";
QCIndexPort = "Index";
QCNumberPort = "Number";
QCStringPort = "String";
QCColorPort = "Color";

QCObjectPort = "Object";
QCStructurePort = "Structure";
QCImagePort = "Image";

CompositionList_Title = "Loaded Composition List";
CompositionEditor_Title = "Quartz Composer Editor";

Protocol_GraphicAnimation = "Graphic Animation";
Protocol_GraphicTransition = "Graphic Transition";
Protocol_ImageFilter = "Image Filter";
Protocol_ScreenSaver = "Screen Saver";
Protocol_RSSVisualizer = "RSS Visualizer";
Protocol_MusicVisualizer = "Music Visualizer";
Protocol_PhotoVisualizer = "Photo Visualizer";
Protocol_MeshFilter = "Mesh Filter";